Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129XNCZAD.svd
        <register>
          <name>PRI2C</name>
          <description>Inter-Integrated Circuit Peripheral Ready</description>
          <addressOffset>0x00000A20</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRI2C_R0</name>
              <description>I2C Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R1</name>
              <description>I2C Module 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R2</name>
              <description>I2C Module 2 Peripheral Ready</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R3</name>
              <description>I2C Module 3 Peripheral Ready</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R4</name>
              <description>I2C Module 4 Peripheral Ready</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R5</name>
              <description>I2C Module 5 Peripheral Ready</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R6</name>
              <description>I2C Module 6 Peripheral Ready</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R7</name>
              <description>I2C Module 7 Peripheral Ready</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R8</name>
              <description>I2C Module 8 Peripheral Ready</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R9</name>
              <description>I2C Module 9 Peripheral Ready</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRUSB</name>
          <description>Universal Serial Bus Peripheral Ready</description>
          <addressOffset>0x00000A28</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRUSB_R0</name>
              <description>USB Module Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PREPHY</name>
          <description>Ethernet PHY Peripheral Ready</description>
          <addressOffset>0x00000A30</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PREPHY_R0</name>
              <description>Ethernet PHY Module Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRCAN</name>
          <description>Controller Area Network Peripheral Ready</description>
          <addressOffset>0x00000A34</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRCAN_R0</name>
              <description>CAN Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRCAN_R1</name>
              <description>CAN Module 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRADC</name>
          <description>Analog-to-Digital Converter Peripheral Ready</description>
          <addressOffset>0x00000A38</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRADC_R0</name>
              <description>ADC Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRADC_R1</name>
              <description>ADC Module 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRACMP</name>
          <description>Analog Comparator Peripheral Ready</description>
          <addressOffset>0x00000A3C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRACMP_R0</name>
              <description>Analog Comparator Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRPWM</name>
          <description>Pulse Width Modulator Peripheral Ready</description>
          <addressOffset>0x00000A40</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRPWM_R0</name>
              <description>PWM Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRQEI</name>
          <description>Quadrature Encoder Interface Peripheral Ready</description>
          <addressOffset>0x00000A44</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRQEI_R0</name>
              <description>QEI Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PREEPROM</name>
          <description>EEPROM Peripheral Ready</description>
          <addressOffset>0x00000A58</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PREEPROM_R0</name>
              <description>EEPROM Module Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRCCM</name>
          <description>CRC and Cryptographic Modules Peripheral Ready</description>
          <addressOffset>0x00000A74</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRCCM_R0</name>
              <description>CRC and Cryptographic Modules Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRLCD</name>
          <description>LCD Controller Peripheral Ready</description>
          <addressOffset>0x00000A90</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRLCD_R0</name>
              <description>LCD Controller Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PROWIRE</name>
          <description>1-Wire Peripheral Ready</description>
          <addressOffset>0x00000A98</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PROWIRE_R0</name>
              <description>1-Wire Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PREMAC</name>
          <description>Ethernet MAC Peripheral Ready</description>
          <addressOffset>0x00000A9C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PREMAC_R0</name>
              <description>Ethernet MAC Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
