Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129XNCZAD.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AES</name>
      <description>Register map for AES peripheral</description>
      <groupName>AES</groupName>
      <prependToName>AES</prependToName>
      <baseAddress>0x44036000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00002000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>KEY2_6</name>
          <description>AES Key 2_6</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>AES_KEY2_6_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_7</name>
          <description>AES Key 2_7</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>AES_KEY2_7_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_4</name>
          <description>AES Key 2_4</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>AES_KEY2_4_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_5</name>
          <description>AES Key 2_5</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>AES_KEY2_5_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_2</name>
          <description>AES Key 2_2</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>AES_KEY2_2_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_3</name>
          <description>AES Key 2_3</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>AES_KEY2_3_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_0</name>
          <description>AES Key 2_0</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>AES_KEY2_0_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_1</name>
          <description>AES Key 2_1</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>AES_KEY2_1_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_6</name>
          <description>AES Key 1_6</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>AES_KEY1_6_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_7</name>
          <description>AES Key 1_7</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>AES_KEY1_7_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_4</name>
          <description>AES Key 1_4</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>AES_KEY1_4_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_5</name>
          <description>AES Key 1_5</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>AES_KEY1_5_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_2</name>
          <description>AES Key 1_2</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>AES_KEY1_2_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_3</name>
          <description>AES Key 1_3</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>AES_KEY1_3_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_0</name>
          <description>AES Key 1_0</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>AES_KEY1_0_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_1</name>
          <description>AES Key 1_1</description>
          <addressOffset>0x0000003C</addressOffset>
          <fields>
            <field>
              <name>AES_KEY1_1_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_IN_0</name>
          <description>AES Initialization Vector Input 0</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>AES_IV_IN_0_DATA</name>
              <description>Initialization Vector Input</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_IN_1</name>
          <description>AES Initialization Vector Input 1</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>AES_IV_IN_1_DATA</name>
              <description>Initialization Vector Input</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_IN_2</name>
          <description>AES Initialization Vector Input 2</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>AES_IV_IN_2_DATA</name>
              <description>Initialization Vector Input</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_IN_3</name>
          <description>AES Initialization Vector Input 3</description>
          <addressOffset>0x0000004C</addressOffset>
          <fields>
            <field>
              <name>AES_IV_IN_3_DATA</name>
              <description>Initialization Vector Input</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>AES Control</description>
          <addressOffset>0x00000050</addressOffset>
          <fields>
            <field>
              <name>AES_CTRL_OUTPUT_READY</name>
              <description>Output Ready Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AES_CTRL_INPUT_READY</name>
              <description>Input Ready Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AES_CTRL_DIRECTION</name>
              <description>Encryption/Decryption Selection</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AES_CTRL_KEY_SIZE</name>
              <description>Key Size</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AES_CTRL_KEY_SIZE_128</name>
                  <description>Key is 128 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_CTRL_KEY_SIZE_192</name>
                  <description>Key is 192 bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_CTRL_KEY_SIZE_256</name>
                  <description>Key is 256 bits</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AES_CTRL_MODE</name>
              <description>ECB/CBC Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AES_CTRL_CTR</name>
              <description>Counter Mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AES_CTRL_CTR_WIDTH</name>
              <description>AES-CTR Mode Counter Width</description>
              <bitRange>[8:7]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AES_CTRL_CTR_WIDTH_32</name>
                  <description>Counter is 32 bits</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_CTRL_CTR_WIDTH_64</name>
                  <description>Counter is 64 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_CTRL_CTR_WIDTH_96</name>
                  <description>Counter is 96 bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_CTRL_CTR_WIDTH_128</name>
                  <description>Counter is 128 bits</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AES_CTRL_ICM</name>
              <description>AES Integer Counter Mode (ICM) Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AES_CTRL_CFB</name>
              <description>Full block AES cipher feedback mode (CFB128) Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>AES_CTRL_XTS</name>
              <description>AES-XTS Operation Enabled</description>
              <bitRange>[12:11]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AES_CTRL_XTS_NOP</name>
                  <description>No operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_CTRL_XTS_TWEAKJL</name>
                  <description>Previous/intermediate tweak value and j loaded (value is loaded via IV, j is loaded via the AAD length register)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_CTRL_XTS_K2IJL</name>
                  <description>Key2, n and j are loaded (n is loaded via IV, j is loaded via the AAD length register)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_CTRL_XTS_K2ILJ0</name>
                  <description>Key2 and n are loaded; j=0 (n is loaded via IV)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AES_CTRL_F8</name>
              <description>AES f8 Mode Enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AES_CTRL_F9</name>
              <description>AES f9 Mode Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>AES_CTRL_CBCMAC</name>
              <description>AES-CBC MAC Enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>AES_CTRL_GCM</name>
              <description>AES-GCM Mode Enable</description>
              <bitRange>[17:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AES_CTRL_GCM_NOP</name>
                  <description>No operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_CTRL_GCM_HLY0ZERO</name>
                  <description>GHASH with H loaded and Y0-encrypted forced to zero</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_CTRL_GCM_HLY0CALC</name>
                  <description>GHASH with H loaded and Y0-encrypted calculated internally</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_CTRL_GCM_HY0CALC</name>
                  <description>Autonomous GHASH (both H and Y0-encrypted calculated internally)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AES_CTRL_CCM</name>
              <description>AES-CCM Mode Enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>AES_CTRL_CCM_L</name>
              <description>L Value</description>
              <bitRange>[21:19]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AES_CTRL_CCM_L_2</name>
                  <description>width = 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_CTRL_CCM_L_4</name>
                  <description>width = 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_CTRL_CCM_L_8</name>
                  <description>width = 8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AES_CTRL_CCM_M</name>
              <description>Counter with CBC-MAC (CCM)</description>
              <bitRange>[24:22]</bitRange>
            </field>
            <field>
              <name>AES_CTRL_SAVE_CONTEXT</name>
              <description>TAG or Result IV Save</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AES_CTRL_SVCTXTRDY</name>
              <description>AES TAG/IV Block(s) Ready</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AES_CTRL_CTXTRDY</name>
              <description>Context Data Registers Ready</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C_LENGTH_0</name>
          <description>AES Crypto Data Length 0</description>
          <addressOffset>0x00000054</addressOffset>
          <fields>
            <field>
              <name>AES_C_LENGTH_0_LENGTH</name>
              <description>Data Length</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C_LENGTH_1</name>
          <description>AES Crypto Data Length 1</description>
          <addressOffset>0x00000058</addressOffset>
          <fields>
            <field>
              <name>AES_C_LENGTH_1_LENGTH</name>
              <description>Data Length</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTH_LENGTH</name>
          <description>AES Authentication Data Length</description>
          <addressOffset>0x0000005C</addressOffset>
          <fields>
            <field>
              <name>AES_AUTH_LENGTH_AUTH</name>
              <description>Authentication Data Length</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_IN_0</name>
          <description>AES Data RW Plaintext/Ciphertext 0</description>
          <addressOffset>0x00000060</addressOffset>
          <fields>
            <field>
              <name>AES_DATA_IN_0_DATA</name>
              <description>Secure Data RW Plaintext/Ciphertext</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_IN_1</name>
          <description>AES Data RW Plaintext/Ciphertext 1</description>
          <addressOffset>0x00000064</addressOffset>
          <fields>
            <field>
              <name>AES_DATA_IN_1_DATA</name>
              <description>Secure Data RW Plaintext/Ciphertext</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_IN_2</name>
          <description>AES Data RW Plaintext/Ciphertext 2</description>
          <addressOffset>0x00000068</addressOffset>
          <fields>
            <field>
              <name>AES_DATA_IN_2_DATA</name>
              <description>Secure Data RW Plaintext/Ciphertext</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_IN_3</name>
          <description>AES Data RW Plaintext/Ciphertext 3</description>
          <addressOffset>0x0000006C</addressOffset>
          <fields>
            <field>
              <name>AES_DATA_IN_3_DATA</name>
              <description>Secure Data RW Plaintext/Ciphertext</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAG_OUT_0</name>
          <description>AES Hash Tag Out 0</description>
          <addressOffset>0x00000070</addressOffset>
          <fields>
            <field>
              <name>AES_TAG_OUT_0_HASH</name>
              <description>Hash Result</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAG_OUT_1</name>
          <description>AES Hash Tag Out 1</description>
          <addressOffset>0x00000074</addressOffset>
          <fields>
            <field>
              <name>AES_TAG_OUT_1_HASH</name>
              <description>Hash Result</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAG_OUT_2</name>
          <description>AES Hash Tag Out 2</description>
          <addressOffset>0x00000078</addressOffset>
          <fields>
            <field>
              <name>AES_TAG_OUT_2_HASH</name>
              <description>Hash Result</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAG_OUT_3</name>
          <description>AES Hash Tag Out 3</description>
          <addressOffset>0x0000007C</addressOffset>
          <fields>
            <field>
              <name>AES_TAG_OUT_3_HASH</name>
              <description>Hash Result</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REVISION</name>
          <description>AES IP Revision Identifier</description>
          <addressOffset>0x00000080</addressOffset>
          <fields>
            <field>
              <name>AES_REVISION</name>
              <description>Revision number</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCONFIG</name>
          <description>AES System Configuration</description>
          <addressOffset>0x00000084</addressOffset>
          <fields>
            <field>
              <name>AES_SYSCONFIG_SOFTRESET</name>
              <description>Soft reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AES_SYSCONFIG_DMA_REQ_DATA_IN_EN</name>
              <description>DMA Request Data In Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AES_SYSCONFIG_DMA_REQ_DATA_OUT_EN</name>
              <description>DMA Request Data Out Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AES_SYSCONFIG_DMA_REQ_CONTEXT_IN_EN</name>
              <description>DMA Request Context In Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AES_SYSCONFIG_DMA_REQ_CONTEXT_OUT_EN</name>
              <description>DMA Request Context Out Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AES_SYSCONFIG_MAP_CONTEXT_OUT_ON_DATA_OUT</name>
              <description>Map Context Out on Data Out Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AES_SYSCONFIG_KEYENC</name>
              <description>Key Encoding</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>AES_SYSCONFIG_K3</name>
              <description>K3 Select</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
